import React from "react";
import { Text, ScrollView, SafeAreaView, StyleSheet } from "react-native";

const PostOneText = () => {
  return (
    <SafeAreaView style={styles.textWrapper}>
      <ScrollView contentContainerStyle={styles.textContainer}>
        <Text style={{ padding: 25, fontSize: 20 }}>
          Төгсөөд жилийн дараа сургуульдаа ирэхэд үгээр илэрхийлэхийн аргагүй
          маш гоё сэтгэгдэл төрсөн. Сургуулийн үүдээр орж ирээд л оюутны дөрвөн
          жилийн дурсамж нүдний өмнүүр жирэлзээд л өнгөрөх шиг болж, сэтгэл
          огшоод ирсэн дээ. Сургуулиа болон сургуулийн хамт олноо, найз нөхөд,
          багш нараа маш их санасан байна. Төгсөгчдийн анхдугаар уулзалтыг
          зохион байгуулсан ШМТДС-ийнхандаа маш их баярлаж байна. Одоо хаана,
          ямар ажил эрхэлж буйгаа танилцуулахгүй юу? - Барилгын зураг төслийн
          хувийн компанид Барилга, бүтцийн инженерээр ажиллаж байна. Төгссөн
          мэргэжлээрээ ажиллаж байгаа ч ажлын байран дээрээ дахин суралцсаар л
          явна даа. Ажлын байр дээр бакалавртаа суралцаж, эзэмшсэн мэдлэгээ
          хэрэглэхэд бэрхшээл байсан уу? - Эзэмшсэн мэдлэгээ ажлын байран дээр
          хэрэглэхэд ямар ч бэрхшээл гараагүй. Харин мэргэжлийн хичээлээр олж
          авсан мэдлэгээ бие даан илүү бататгаж, бүр цааш нь гүнзгийрүүлэн
          судалдаг байж дээ гэж бодогдож байсан. Ажлын байран дээр гараад
          эзэмшсэн мэдлэгээ хэдий цааш гүнзгийрүүлэн судалж үзэхийг хүсэж байлаа
          ч ажлын ачааллаас шалтгаалан бие дааж онолын мэдлэгээ бататгах,
          гүнзгийрүүлэн үзэж судлах цаг төдийлөн гарахгүй тул оюутан байхдаа
          сонирхож байгаа чиглэлээ барьж аваад түүнийгээ гүнзгийрүүлэн үзэж
          судалбал илүү зүгээр байсан юм болов уу гэж бодсон.
        </Text>
      </ScrollView>
    </SafeAreaView>
  );
};
const styles = StyleSheet.create({
  textWrapper: {
    position: "absolute",
    width: "100%",
    height: 380,
    bottom: 10,
    backgroundColor: "#773537",
    opacity: 0.5,
    borderRadius: 25,
    justifyContent: "center",
  },
  textContainer: {
    display: "flex",
    top: 120,
    backgroundColor: "#fff",
    zIndex: 1000,
    opacity: 1,
    borderRadius: 25,
    marginHorizontal: 20,
    paddingBottom: 150,
  },
});

export default PostOneText;
