import React from "react";
import { Text, ScrollView, SafeAreaView, StyleSheet } from "react-native";

const PostOneText = () => {
  return (
    <SafeAreaView style={styles.textWrapper}>
      <ScrollView contentContainerStyle={styles.textContainer}>
        <Text style={{ padding: 25, fontSize: 20 }}>
          БАРИЛГЫН ИНЖЕНЕРИЙН НЭГДҮГЭЭР ҮЕИЙН ТӨГСӨГЧ 1. Саяхан л сургуулиа
          төгсөж байсан ч хэдийн гурван жил өнгөрчээ. Төгсөгчдийн уулзалтаар
          төрөлх сургуульдаа эргээд ирэхэд ямар сэтгэгдэл төрж байна? -
          Сургуульдаа удаан хугацааны дараа эргээд бүх зүйлс нь дотно, багш,
          ажилчидтайгаа уулзаад халуун дулаан яриа өрнүүлэхэд оюутан насандаа
          очсон юм шиг сайхан санагдлаа. 2. Энхсайханы хувьд сургуулиа төгсөөд
          Японд магистрт суралцаж, амжилттай төгсөөд ирсэн. Энэ тухайгаа ярьж
          өгөөч? Ямар чиглэлээр, ямар сургуульд суралцсан бэ? - Би бакалавраа
          барилгын инженер мэргэжлээр төгсөөд Япон Улсын Засгийн газрын 100
          хувийн тэтгэлгээр Ёкохамагийн Үндэсний Их Сургуульд “Structural
          engineer”-ээр магистрын зэрэг хамгаалсан. Тус сургууль 1949 онд
          байгуулагдсан, 42 улсын 139 их дээд сургуулиудтай хамтран ажилладаг,
          судалгааны чанар болон төгсөгчдийн ажилд орох зэргээрээ улсдаа
          дээгүүрт ордог сургууль. Миний суралцсан International Infrastructure
          Management хөтөлбөр нь инженерийн мэдлэгээс гадна менежментийг давхар
          заадгаараа онцлог. 3. Одоо хаана, ямар ажил эрхэлж буйгаа
          танилцуулахгүй юу? - Японд магистрын зэрэг хамгаалахаар хоёр жил
          суралцаж төгсөөд зургаан сар судлаач оюутнаар үргэлжлүүлэн суралцаж,
          эх орондоо эргэн ирээд авто замын судалгааны iROAD институтэд
          Гүйцэтгэх захирлаар томилогдон ажиллаж байна. Манай институт олон
          салбарын эрдэмтэд болон инженерүүдийг холбож авто замд гардаг
          асуудлуудыг шийдэх зорилгоор хэд хэдэн төслүүдийг амжилттай эхлүүлээд
          явж байна. Миний хувьд ажилчдадаа Япон болон бусад олон улсын
          судалгааны аргуудаас заан чиглүүлж, эерэг манлайлал үүсгэхээр
          хичээнгүйлэн ажиллаж байна.
        </Text>
      </ScrollView>
    </SafeAreaView>
  );
};
const styles = StyleSheet.create({
  textWrapper: {
    position: "absolute",
    width: "100%",
    height: 380,
    bottom: 10,
    backgroundColor: "#773537",
    opacity: 0.5,
    borderRadius: 25,
    justifyContent: "center",
  },
  textContainer: {
    display: "flex",
    top: 120,
    backgroundColor: "#fff",
    zIndex: 1000,
    opacity: 1,
    borderRadius: 25,
    marginHorizontal: 20,
    paddingBottom: 150,
  },
});

export default PostOneText;
